In [1]:
import pandas as pd

-----
#### `[1] Creating datafram`

-----

In [2]:
Data = pd.DataFrame({
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 22,  21,  12,  14,  20],
    'id'     : ['A101', 'A102', 'A103', 'A104', 'A105']
})

In [3]:
Data

  gender grade  marks    id
0      M     A     22  A101
1      F     A     21  A102
2      M     B     12  A103
3      M     B     14  A104
4      F     A     20  A105

In [4]:
Data.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
Data.columns

Index(['gender', 'grade', 'marks', 'id'], dtype='object')

In [6]:
Data.shape

(5, 4)

-----
#### `[2] creating dataframe with columns name and position based index.`
-----

In [7]:
Data2 = pd.DataFrame({
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 22,  21,  12,  14,  20],
    'id'     : ['A101', 'A102', 'A103', 'A104', 'A105']
}, columns = ['gender','grade','marks','id'], index = [1,2,3,4,5])

In [8]:
Data2

  gender grade  marks    id
1      M     A     22  A101
2      F     A     21  A102
3      M     B     12  A103
4      M     B     14  A104
5      F     A     20  A105

-----
#### `[3] Changing Position based index.`
-----

In [9]:
Data.index = [2,3,4,5,6]

In [10]:
Data

  gender grade  marks    id
2      M     A     22  A101
3      F     A     21  A102
4      M     B     12  A103
5      M     B     14  A104
6      F     A     20  A105

-----
#### `[4] Changing columns name.`
-----

In [11]:
Data.columns = ['gend','grad','mar','id']

In [12]:
Data

  gend grad  mar    id
2    M    A   22  A101
3    F    A   21  A102
4    M    B   12  A103
5    M    B   14  A104
6    F    A   20  A105

-----
#### `[5] Changing Position based index to label based index.`
-----

In [13]:
# 1. change the index of the dataframe
# 2. drop=True is used to drop the column that's set as index
# 3. inplace=True is used to make changes in the original dataframe

Data.set_index('id', drop=False, inplace=False)

     gend grad  mar    id
id
A101    M    A   22  A101
A102    F    A   21  A102
A103    M    B   12  A103
A104    M    B   14  A104
A105    F    A   20  A105

In [14]:
Data

  gend grad  mar    id
2    M    A   22  A101
3    F    A   21  A102
4    M    B   12  A103
5    M    B   14  A104
6    F    A   20  A105

In [15]:
Data.set_index('id', drop=True, inplace=True)

In [16]:
Data

     gend grad  mar
id
A101    M    A   22
A102    F    A   21
A103    M    B   12
A104    M    B   14
A105    F    A   20

-----
#### `[6] reset index.`
-----

In [17]:
Data.reset_index(inplace=True) # reset index will add the new position based index.

In [18]:
Data

     id gend grad  mar
0  A101    M    A   22
1  A102    F    A   21
2  A103    M    B   12
3  A104    M    B   14
4  A105    F    A   20

In [19]:
Data.sort_values(by = ['mar'],inplace=True)

In [20]:
Data

     id gend grad  mar
2  A103    M    B   12
3  A104    M    B   14
4  A105    F    A   20
1  A102    F    A   21
0  A101    M    A   22

In [21]:
Data.reset_index(inplace=False)

   index    id gend grad  mar
0      2  A103    M    B   12
1      3  A104    M    B   14
2      4  A105    F    A   20
3      1  A102    F    A   21
4      0  A101    M    A   22

In [22]:
Data.reset_index(inplace=True, drop=True)

In [23]:
Data

     id gend grad  mar
0  A103    M    B   12
1  A104    M    B   14
2  A105    F    A   20
3  A102    F    A   21
4  A101    M    A   22

-----
#### `[7] Adding new column to existing dataframe.`
-----

In [24]:
Data['kd'] = [1,2,3,4,5]

In [25]:
Data

     id gend grad  mar  kd
0  A103    M    B   12   1
1  A104    M    B   14   2
2  A105    F    A   20   3
3  A102    F    A   21   4
4  A101    M    A   22   5